import React, { Component } from 'react';
import styled from "styled-components";

const Container = styled.div``;

class UsageTerm extends Component {
    public render() {
        return (
            <Container>
                <h2>플러그 이용약관</h2>
                <h4>제1조 목적</h4>
                <p>플러그 이용자 여러분 반갑습니다. 주식회사 플러그(이하 ‘회사’)가 제공하는 서비스를 이용해 주셔서 감사합니다. 회사는 여러분(이하 ‘회원’)이 회사가 제공하는 서비스에 이용 관련 정보를 약관(이하 ‘본 약관’)에 담아 안내해 드립니다. 본 약관은 회원이 서비스를 이용하는 데 필요한 권리, 의무 및 책임 사항, 이용조건 및 절차 등 기본적인 사항을 규정하고 있습니다.</p>
                <h4>제2조 정의</h4>
                <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
    “서비스”라 함은 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 회원이 이용할 수 있는 플러그 관련 제반 서비스를 의미합니다.
    “회원”이란 회사의 “서비스”에 접속하여 이 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다.
    “클래스”는 커뮤니케이션을 목적으로 선생님, 학부모가 본 사이트에 개설할 수 있는 공간을 의미합니다.
    “게시물”은 여러분이 서비스 이용 시 서비스상에 게시한 부호 · 문자 · 음성 · 음향 · 화상 · 동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.
“메시지”는 여러분이 서비스 이용 시 클래스 안에서 상대방에게 전송한 부호 · 문자 · 음성 · 음향 · 화상 · 동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.</p>
                <h4>제3조 약관의 게시와 개정</h4>
                <p>
                    본 약관의 내용은 회사가 제공하는 개별 서비스 또는 서비스 초기 화면에 게시하거나 기타의 방법으로 공지하고, 본 약관에 동의한 여러분 모두에게 그 효력이 발생합니다.
                    회사는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 회원은 변경된 약관에 대해 거부할 권리가 있습니다. 변경에 동의하지 않는 회원은 변경 된 약관이 공지된 지 15일 이내에 거부의사를 표명 할 수 있습니다. 회원이 약관변경에 거부하는 경우 회사는 15일 기간을 정하여 고객에게 사전 통지 후 계약을 해지 할 수 있습니다. 만약, 이용고객이 거부의사를 표시하지 않고 서비스를 계속 이용하는 경우에는 동의하는 것으로 간주 합니다.
</p>
                <h4>제4조 약관 외 준칙</h4>
                <p>
                    이 약관에서 정하지 아니한 사항이나 해석에 대해서는 관계법령 또는 상관례에 따릅니다.
</p>
                <h3>플러그 계정</h3>
                <h4>제5조 이용계약 체결</h4>
                <p>
                    이용계약은 회원이 되고자 하는 자(이하 "가입신청자")가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
                    회사는 가입신청자의 신청에 대하여 서비스 이용 승낙을 원칙으로 합니다. 다만, 회사는 다음 몇가지 경우에 대하여 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
                    가입신청자가 이 약관에 의하여 이전에 계정을 삭제당한 경우로, 이 때 회사의 회원 재가입 승낙을 얻은 경우는 예외로 합니다.
                    허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우가 해당됩니다.
                    여러분의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우입니다.
                    그 밖에도 회사에 서비스 관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
                    본 조에 정한바에 따라 회원가입신청의 승낙을 하지 않거나 유보한 경우, 회사는 원칙적으로 이를 가입신청자에게 알리도록 합니다.
                    이용계약의 성립 시기는 회사가 가입완료를 신청절차 상에서 표시한 시점으로 하며, 회사는 여러분을 회사 정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.
</p>
                <h4>제6조 회원정보의 변경</h4>
                <p>
                    회원은 개인정보 페이지를 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있으며 회원가입신청 시 기재한 사항이 변경되었을 경우 개인정보를 수정하여 회사에 그 변경사항을 알려야 합니다. 특히, 휴대전화 번호의 경우 변경하거나 비활성화할 경우에는 48시간 내에 회원 계정 정보를 업데이트해야 합니다. 그렇지 않은 경우 여러분의 기존 휴대폰 번호를 습득한 사용자에게 여러분의 메시지가 전송될 수 있습니다.
                    변경사항을 회사에 알리지 않아 발생한 불이익에 대해 회사는 책임지지 않습니다.
</p>
                <h4>제7조 개인정보보호 의무</h4>
                <p>회사는 관계 법령이 정하는 바에 따라 여러분의 개인정보를 보호하며, 개인정보의 보호 및 사용에 대해서는 관련법 및 회사의 개인정보취급방침이 적용됩니다. 다만, 회사의 공식 사이트 이외의 링크된 사이트에서는 회사의 개인정보취급방침이 적용되지 않습니다.</p>
                <h4>제8조 회원의 아이디 및 비밀번호의 관리에 대한 의무</h4>
                <p>회원의 "아이디"와 "비밀번호"에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
                회사는 회원의 "아이디"가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 회사 및 회사의 운영자로 오인한 우려가 있는 경우, 해당 "아이디"의 이용을 제한할 수 있습니다.
                회원은 "아이디" 및 "비밀번호"가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 회사에 통지하고 회사의 안내에 따라야 합니다.
제3항의 경우에 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.</p>
                <h3>서비스의 이용</h3>
                <h4>제9조 회사의 의무</h4>
                <p>회사는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
    회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.
    회사는 서비스이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하기 위해 노력합니다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 기타 회사가 적당하다고 판단하는 방법 등을 통하여 여러분께 처리과정 및 결과를 전달합니다.
</p>
                <h4>제10조 회원의 의무</h4>
                <p>
                    회원은 다음 행위를 하여서는 안 됩니다.
                    신청 또는 변경 시 허위내용의 등록
                    타인의 정보도용
                    회사가 게시한 정보의 변경
                    회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
                    회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해
                    회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
                    외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
                    회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
                    기타 불법적이거나 부당한 행위
                    회원은 관계법, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안 됩니다.
                    여러분은 본 서비스를 이용하는 모든 행위 및 그 결과에 대해 모두 책임을 집니다. 서비스 이용시 발생하는 분쟁에 대해 해당 사용자는 자신의 책임과 비용에 대해 해결하지 않으면 안되며, 회사는 일절의 책임을 지지 않습니다.
                    클래스를 개설한 관리자는 스스로의 개설한 클래스에 책임을 지고 운영하고 개설한 클래스에 참가하는 사용자를 책임 관리하는 것을 원칙으로합니다. 클래스의 구성원이 부적절한 게시글을 등록했을 경우에는, 삭제/신고 등의 조치를 실시할 의무를 지는 것으로 합니다. 스스로의 개설하는 클래스 이외의 클래스에 참가하는 경우는 관리자가 아닌 구성원로서 취급하는 것으로 해, 해당 참가한 클래스 관리자의 지시에 따르는 것으로 합니다.
                    회사는 회사의 재량에 의해 클래스의 정지, 폐쇄를 실시할 수 있으며, 회사의 조치에 의해 회원에게 발생한 손해에 대해 일절의 책임을 지지 않는 것으로 합니다.
</p>
                <h4>제11조 서비스의 제공 등</h4>
                <p>
                    회사는 플러그가 개발한 일체의 서비스를 제공합니다.
                    회사는 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.
                    서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.
                    회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 [제21조 회원에 대한 통지]에 정한 방법으로 회원에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
                    회사는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.
</p>
                <h4>
                    제12조 서비스의 변경
</h4>
                <p>
                    회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있습니다.
                    서비스의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 내 공지사항 화면 등 회원이 충분히 인지할 수 있는 방법으로 게시합니다.
                    회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.
</p>
                <h4>
                    제13조 정보의 제공 및 광고의 게재
</h4>
                <p>
                    회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 서비스 내 알림 등의 방법으로 회원에게 제공할 수 있습니다. 다만, 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.
                    다만, 여러분에게 영리목적의 광고성 정보를 SMS등 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 여러분의 사전 동의를 받아서 전송합니다.
                    회사는 서비스의 운영과 관련하여 서비스 화면, 메세지 화면, 홈페이지 등에 광고를 게재할 수 있습니다. 여러분은 회사가 제공하는 서비스와 관련하여 메세지, 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.
</p>
                <h4>
                    제14조 게시물의 저작권
</h4>
                <p>
                    회원이 서비스 내에 게시한 "게시물"의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
                    서비스에 대한 저작권 및 지적재산권은 회사에 귀속되며 이 때 여러분이 작성하신 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
                    회원이 서비스 내에 게시하는 "게시물"이나 “메세지”는 검색결과 내지 서비스 및 관련 프로모션 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 여러분은 회사에 대하여 해당 게시물의 삭제, 검색결과 제외, 비공개 기타 필요한 조치를 요청할 수 있습니다.
</p>
                <h4>
                    제15조 클래스와 게시물의 관리
</h4>
                <p>
                    클래스 관리자는 클래스 가입을 승인 또는 거부할 수 있으며, 이후에도 활동 중인 구성원을 탈퇴시킬 수 있습니다. 클래스는 관리자 가입 승인 및 클래스 구성원의 초대에 의해서만 가입이 됩니다.
                    플러그 활동 중 여러분이 작성한 게시물, 메세지가 관련법에 위반되는 내용을 포함하는 경우 권리자는 관련법이 정한 절차에 따라 게시물, 메세지를 삭제 통보할 수 있으며 회사는 관련법에 따라 조치를 취합니다.
                    권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 메세지와 이러한 내용이 포함된 클래스에 대해 임시조치 등을 취할 수 있습니다.
                    회사는 관계 법령 또는 이 약관의 준수 여부 등을 확인할 필요가 있을 때 게시물 또는 대화 내용을 확인할 수 있습니다.
                    이용자들의 복수 신고를 통한 삭제, 특정한 인프라적인 문제로 인해 일정 기간 이후에는 서비스 상에서 삭제될 수 있으며 게시물에 대한 관리 책임은 회원에게 있습니다.
</p>
                <h4>
                    제16조 권리의 귀속
</h4>
                <p>
                    서비스에 대한 저작권 및 지적재산권은 회사에 귀속됩니다. 단, 회원의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
                    회사는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라 계정, 아이디, 콘텐츠, 코인 등을 이용할 수 있는 이용권만을 부여하며, 회원은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.
</p>
                <h4>제17조 유료 서비스의 이용</h4>
                <p>
                    회사는 무료로 서비스를 제공하고 있으나, 일부 유료 서비스가 추가될 수 있고 그 경우 사전에 공지가 이루어질 계획입니다.
            </p>
                <h4>제18조 계약해제, 해지 등</h4>
                <p>
                    회원은 언제든지 서비스 내 계정삭제 화면을 통하여 이용계약 해지 신청을 할 수 있으며, 회사는 관련법령 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
    회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸되며 이는 복구할 수 없습니다.
    회원이 계약을 해지하는 경우, 프로필 사진 등과 같이 여러분을 식별할 수 있는 본인계정에 등록 내용 일체는 삭제됩니다. 다만, 타인에게 이미 보낸 메시지 등은 삭제되지 않으니 사전에 삭제 후 탈퇴하시기 바랍니다.
            </p>
                <h4>제19조 이용제한 등</h4>
                <p>
                    회사는 회원이 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 서비스 이용을 단계적으로 제한할 수 있습니다.
    불법프로그램의 제공 및 운영방해, 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 영구이용정지 시 서비스 이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다. 관련 제한의 조건 및 세부내용은 이용제한정책 및 운영정책을 따릅니다.
    서비스 이용을 제한하거나 계약을 해지하는 경우에는 회사는 통지 방식에 따라 알리게 되며 이 때 여러분은 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다
            </p>
                <h3>기타</h3>
                <h4>제20조 책임제한</h4>
                <p>
                    회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
    회사는 단말기 등 접근 매체의 분실로 인한 서비스 이용장애 등과 같은 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.
    본 서비스의 내용의 추가, 변경 또는 서비스 중단, 종료로 인한 손해에 대해 책임을지지 않습니다. 액세스 과다, 기타 예상치 못한 요인으로 표시 속도 저하 및 장애 등이 발생한 경우도 마찬가지입니다.
    회사는 회원이 게시한 정보를 모니터링하고 저장 할 의무를지지 않으며, 여러분이 제공한 정보에 대해 합법성, 도덕성, 신뢰성, 정확성에 대해 책임을지지 않습니다.
    회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 회사가 책임을 지지 않습니다.
    회사는 본 서비스와 관련하여 사용자가 입은 손해에 대하여 배상 책임을지지 않습니다. 또한, 사용자에게 발생한 손해가 당사의 채무 불이행 또는 불법 행위에 근거하는 경우, 당사는 사용자가 직접 입은 손해에 한해 지난 6 개월에 사용자가 회사에 지불 한 이용 요금의 총액을 상한으로 손해 배상 책임을 집니다. 그러나 당사에 고의 또는 중과실이있는 경우에 한합니다.
    회사는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.
    본 서비스에서 다른 서비스로의 링크 또는 다른 서비스에서 본 서비스에 대한 링크가 제공되는 경우에도 당사는 본 서비스 이외의 서비스와 거기에서 얻은 정보에 관해서 어떤 이유에 따라 도 책임을지지 않습니다.
            </p>
                <h4>제21조 회원에 대한 통지</h4>
                <p>
                    회사가 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 서비스 내 알림 또는 기타 회사가 적당하다고 판단하는 방법으로 할 수 있습니다.
    회사는 회원 전체에 대한 통지의 경우 7일 이상 서비스 초기화면 또는 공지사항 등에 게시함으로써 통지를 갈음할 수 있습니다.
            </p>
                <h4>제22조 준거법 및 재판관할</h4>
                <p>
                    본 약관과 관련해 회사와 여러분간에 제기된 소송은 대한민국법을 준거법으로 하며, 발생한 분쟁에 대해서는 민사소송법 상 정한 절차를 따릅니다.
            </p>
            </Container>

        );
    }
}

export default UsageTerm;
