import React, { Component } from 'react';
import styled from "styled-components";

const Container = styled.div`
    padding: 10px;
`;

class PrivateTerm extends Component {
    public render() {
        return (
            <Container>
                <h5>
                    저희 플러그 팀은 플러그 회원의 개인정보를 매우 소중하게 보호합니다.  플러그는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「개인정보 보호법」 을 비롯한 개인정보 관련 법령을 준수하고 있습니다. 제공하신 개인정보는 동의하신 목적과 범위 내에서만 이용되며, 별도의 동의 없이는 결코 제3자에게 제공되지 않습니다. 또한 기본적 인권 침해의 우려가 있는 민감한 개인정보는 수집하지 않습니다. 본 개인정보취급방침은 웹사이트와 어플리케이션에서 언제든 확인하실 수 있습니다.
                </h5>
                <h3>
                    개인정보처리방침의 의미와 목적
</h3>

                “개인정보 처리방침”이란 사용자의 소중한 개인정보를 보호함으로써 사용자가 안심하고 서비스를 이용할 수 있도록 회사가 준수해야 할 지침을 의미합니다. 본 개인정보취급방침은 개인정보를 안전하게 취급하기 위한 플러그의 정책과 관련 사항을 알려드리기 위해 마련되었습니다.
<h4>
                    2. 수집하는 개인정보
      </h4>

                플러그는 여러분이 플러그 서비스에 처음 가입할 때 또는 서비스를 이용하는 과정에서 플러그 홈페이지 또는 어플리케이션을 통하여 개인정보를 수집하고 있습니다.

                회원가입시에 이메일주소, 사용자 이름, 비밀번호를 필수항목으로 수집합니다.
<h4>
                    3. 수집한 개인정보의 이용
    </h4>

                저희 플러그 팀은 아래와 같은 목적으로만 수집한 개인정보를 이용합니다.

                •이용자에게 서비스 및 추가 서비스를 제공하고, 이용자가 메세지나 직접 생성한 콘텐츠를 다른 이용자에게 전송 혹은 공유하기 위해서
                •이용자의 사전 합의에 근거하여 다른 이용자와 연결하기 위하여
                •보다 다양하고 편리한 기능의 이용을 희망하는 이용자에게 부가서비스를 제공하기 위하여
                •인가되지 않은 방법으로 서비스를 이용하거나 또는 부정한 사용을 감시, 억제, 예방하기 위하여
                •서비스 및 부가서비스를 개선하고, 그와 관련된 정보를 이용자에게 제공하기 위해
                •회사가 이용자의 문의 사항이나 요청에 효과적으로 지원을 하기 위하여
                •필요시 서비스 또는 부가서비스에 관한 중요한 정보를 이용자에게 통지하기 위하여
                •적용받는 법률 또는 법적 의무를 준수하기 위하여
<h4>
                    4. 개인정보 자동 수집 장치
    </h4>
                플러그는 여러분에게 개인화된 서비스를 제공하기 위해 개인용 컴퓨터(PC)에 있는 정보를 수시로 저장하고 불러오는 ‘쿠키(cookie)’를 통해 운용합니다. 쿠키란 웹사이트를 운영하는데 이용되는 서버가 여러분의 브라우저에 보내는 작은 텍스트 파일로, PC의 하드디스크에 저장됩니다. 여러분이 웹 사이트에 방문할 때 웹 사이트 서버는 쿠키의 내용을 읽어 환경 설정을 유지하도록 함으로써 여러분이 편리하게 웹사이트를 이용하도록 돕습니다. 아울러 쿠키는 여러분의 웹 사이트 방문 기록, 이용 형태를 알게 하여 이를 통한 최적화된 맞춤 서비스가 가능하도록 합니다. 여러분은 쿠키 설치에 대한 선택권을 가지고 있으며, 웹브라우저의 옵션에서 쿠키 사용과 관련된 설정을 할 수 있습니다. 다만, 쿠키를 설치하지 않을 경우 로그인이 필요한 일부 서비스를 이용하는 것에는 어려움이 있을 수 있음을 이해 부탁드립니다.
                 플러그는 웹 분석 서비스인 Firebase와 Amplitude를 사용합니다. Firebase와 Amplitude는 쿠키를 사용하여 플러그 이용 방식을 분석하는 데 도움을 줍니다. 쿠키를 통해 생성되는 여러분의 플러그 이용 관련 정보(IP 주소 포함)는 미국에 소재한 Firebase와 Amplitude 서버로 이전되어 저장됩니다.  이를 통해 두 회사는 여러분의 플러그 이용을 분석하고, 운영자를 위해 웹사이트 활동 보고서를 편집하고, 웹사이트 활동 및 인터넷 사용과 관련된 기타 서비스를 제공하기 위한 목적으로 이 정보를 사용합니다. 또한, 법률에 의해 요구되는 경우 또는 제3자가 두 회사를 대신하여 정보를 처리하는 경우에 본 정보를 제3자에게 이전할 수 있습니다. Firebase와 Amplitude는 여러분의 IP 주소를 자신들의 그 어떤 종류의 데이터와도 연관시키지 않습니다. 플러그를 사용함으로써 여러분은 위에 언급된 방법과 목적에 따라 두 회사가 여러분의 데이터를 처리하는 데 동의했음을 의미합니다.
 <h4>
                    5. 개인정보 보관 및 파기
   </h4>

                저희 플러그 팀은 여러분의 개인 정보를 회원 탈퇴 시에, 법령 등에 의해 보존할 필요가 있는 경우를 제외하고는 지체 없이 파기합니다.
              여러분의 개인정보는 여러분으로부터 동의를 받은 수집 및 이용목적이 달성된 때에는 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 관계 법령에서 정한 일정한 기간 동안 보관한 다음 파기합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통해 파기하고, 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다. 다만, 플러그 서비스의 부정이용기록은 저희 서비스의 부정한 이용으로 인한 분쟁을 방지하기 위한 내부방침에 따라 1년간 보존한 다음 위의 방법으로 파기됩니다. 플러그 팀이 법령에 따라 보관하는 개인정보 및 해당 법령은 아래 표와 같습니다.

              계약 또는 청약철회 등에 관한 기록
              근거 법령 : 전자상거래 등에서의 소비자보호에 관한 법률
              보존 기간 : 5 년
              대금결제 및 재화등의 공급에 관한 기록
              근거 법령 : 전자상거래 등에서의 소비자보호에 관한 법률
              보존 기간 : 5 년
              소비자의 불만 또는 분쟁처리에 관한 기록
              근거 법령 : 전자상거래 등에서의 소비자보호에 관한 법률
              보존 기간 : 3 년
              전자금융 거래에 관한 기록
              근거 법령 : 전자금융거래법
              보존 기간 : 5 년
              웹사이트 방문기록
              근거 법령 : 통신비밀보호법
              보존 기간 : 3 개월

<h4>
                    6. 이용자 및 법정대리인의 권리와 행사 방법
</h4>

                여러분(만 14세 미만인 경우 법정 대리인)은 언제든지 여러분의 개인정보를 조회, 수정할 수 있으며 수집∙이용에 대한 동의 철회 또는 가입 해지를 요청할 수 있습니다. 개인정보를 조회하거나 수정하고 싶으신 경우 서비스 내 설정 기능을 이용하시고, 가입 해지(동의 철회)를 하시려면 플러그 cs 이메일(teamplugcs@gmail.com)로 연락주시면 됩니다. 기타 문의 사항 역시 플러그 cs 이메일(teamplugcs@gmail.com)으로 연락주시면 곧바로 조치하겠습니다. 여러분이 개인정보의 오류에 대한 정정을 요청하신 경우 플러그는 정정을 완료하기 전까지 해당 개인정보를 이용 또는 제공하지 않습니다.
<h4>
                    7. 개인정보의 안전성 확보조치
</h4>

                저희 플러그 팀은 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취합니다.
                1. 관리적 조치 : 내부관리계획 수립․시행, 정기적 직원 교육 등
                2. 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 고유식별정보 등의 암호화, 보안프로그램 설치
                3. 물리적 조치 : 전산실, 자료보관실 등의 접근통제
<h4>
                    8. 개인정보보호 책임자 안내
</h4>

                저희 플러그 팀은 이용자의 개인정보 관련 문의사항 및 불만 처리 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

                개인정보 보호 책임자
                이름   박태준
                직책   대표
                이메일 lateaching914@gmail.com

                기타 개인정보 침해에 대한 신고나 상담이 필요한 경우에 아래 기관에 문의 가능합니다.
                •개인정보침해신고센터 (privacy.kisa.or.kr / 국번없이 118)
                •대검찰청 사이버수사과 (www.spo.go.kr / 국번없이 1301)
                •경찰청 사이버안전국 (cyberbureau.police.go.kr / 국번없이 182)
                <h4>
                    9. 기타
                </h4>
                개인정보 취급방침이 변경되는 경우 별도로 알려드리도록 하겠습니다. 플러그 팀은 법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보 취급방침을 수정할 수 있습니다. 개인정보 취급방침이 변경되는 경우 플러그 팀은 웹페이지, 어플리케이션에 변경 사항을 게시하며, 변경된 개인정보 취급방침은 게시한 날로부터 7일 후부터 효력이 발생합니다. 변경 내용에 동의하실 경우 저희 서비스를 계속 이용하시면 되고, 만약 변경에 동의하지 않고 회사의 서비스를 더 이상 사용하기를 원치 않을 경우 계정을 폐쇄하는 것을 선택하실 수 있습니다. 변경 사항에 대한 신중한 확인을 부탁드립니다.

                저희 플러그 팀은 여러분의 개인정보를 소중하게 생각합니다. 여러분이 플러그 서비스를 이용하면서 발생하는 모든 개인정보보호 관련 문의는 teamplugcs@gmail.com로 연락해주시기 바랍니다. 항상 플러그 사용자를 위해 노력하는 플러그 팀이 되겠습니다. 감사합니다.

                공고일자: 올리는 날짜
                시행일자: 올리는 날짜로부터 2주 뒤 날짜
            </Container>
        );
    }
}

export default PrivateTerm;
